export const MESSAGE = {
    SUCCESSFUL_UPDATE: "Данные успешно обновлены!",
    FORM: {
      NAME: "Поле name содержит только латиницу, кириллицу, пробел или дефис.",
      EMAIL: "Введите Ваш действующий Email.",
      PASSWORD: "Что-то пошло не так...",
    },
    ERROR: {
      400: "Введены некорректные данные.",
      401: "Вы ввели неправильный логин или пароль.",
      403: "У вас нет доступа к этому ресурсу",
      404: "Страница по указанному маршруту не найдена.",
      409: "Пользователь с таким email уже существует.",
      500: "На сервере произошла ошибка.",
      DEFAULT:
        "Произошла ошибка. Возможно, проблема с соединением или сервер недоступен. ",
    },
  };